### Data Manipulation with Pandas

In [7]:
import pandas as pd

In [39]:
df = pd.read_csv('college_ranking.csv')
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [9]:
df.describe()

,world_rank,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
count,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2000.000000,2200.000000,2200.000000,2200.000000
mean,459.590909,40.278182,275.100455,357.116818,178.888182,459.908636,459.797727,413.417273,496.699500,433.346364,47.798395,2014.318182
std,304.320363,51.740870,121.935100,186.779252,64.050885,303.760352,303.331822,264.366549,286.919755,273.996525,7.760806,0.762130
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,43.360000,2012.000000
25%,175.750000,6.000000,175.750000,175.750000,175.750000,175.750000,175.750000,161.000000,250.500000,170.750000,44.460000,2014.000000
50%,450.500000,21.000000,355.000000,450.500000,210.000000,450.500000,450.500000,406.000000,496.000000,426.000000,45.100000,2014.000000
75%,725.250000,49.000000,367.000000,478.000000,218.000000,725.000000,725.250000,645.000000,741.000000,714.250000,47.545000,2015.000000
max,1000.000000,229.000000,367.000000,567.000000,218.000000,1000.000000,991.000000,812.000000,1000.000000,871.000000,100.000000,2015.000000

In [10]:
df.dtypes

world_rank                int64
institution              object
country                  object
national_rank             int64
quality_of_education      int64
alumni_employment         int64
quality_of_faculty        int64
publications              int64
influence                 int64
citations                 int64
broad_impact            float64
patents                   int64
score                   float64
year                      int64
dtype: object

In [11]:
# Finding missing values
df.isnull().sum()

world_rank                0
institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
dtype: int64

In [12]:
df.isnull().any()

world_rank              False
institution             False
country                 False
national_rank           False
quality_of_education    False
alumni_employment       False
quality_of_faculty      False
publications            False
influence               False
citations               False
broad_impact             True
patents                 False
score                   False
year                    False
dtype: bool

In [13]:
# Filling missing values 
df_fill = df.fillna(0)  # NOT RECOMMENDED

In [14]:
# Filling missing values with the mean of the column
df['broad_impact_filled'] = df['broad_impact'].fillna(df['broad_impact'].mean) 
df.isnull().sum()

world_rank                0
institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
broad_impact_filled       0
dtype: int64

In [40]:
# renaming columns
df = df.rename(columns = {'world_rank':'world_ranking'})
df.head()

,world_ranking,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [21]:
# Data aggregating and grouping
grouped_mean = df.groupby(['institution','world_ranking'])['score'].mean()
print(grouped_mean)

institution                               world_ranking
AGH University of Science and Technology  653              44.71
                                          782              44.26
Aalborg University                        565              44.59
                                          593              44.83
Aalto University                          392              45.58
                                                           ...
École normale supérieure de Cachan        721              44.33
École normale supérieure de Lyon          462              45.25
                                          471              44.87
Örebro University                         639              44.44
                                          656              44.70
Name: score, Length: 2142, dtype: float64

In [22]:
grouped_sum = df.groupby(['institution','world_ranking'])['score'].sum()
print(grouped_sum)

institution                               world_ranking
AGH University of Science and Technology  653              44.71
                                          782              44.26
Aalborg University                        565              44.59
                                          593              44.83
Aalto University                          392              45.58
                                                           ...
École normale supérieure de Cachan        721              44.33
École normale supérieure de Lyon          462              45.25
                                          471              44.87
Örebro University                         639              44.44
                                          656              44.70
Name: score, Length: 2142, dtype: float64

In [28]:
# Aggregating multiple functions
grouped_agg = df.groupby(["institution","national_rank","country"])['score'].agg(['mean','sum','count'])
grouped_agg

                                                                 mean     sum  \
institution                              national_rank country
AGH University of Science and Technology 3             Poland   44.71   44.71
                                         4             Poland   44.26   44.26
Aalborg University                       5             Denmark  44.71   89.42
Aalto University                         4             Finland  45.34   90.68
Aarhus University                        2             Denmark  49.91   99.82
...                                                               ...     ...
École normale supérieure - Paris         2             France   53.95  107.90
                                         3             France   47.70   47.70
École normale supérieure de Cachan       32            France   44.33   44.33
École normale supérieure de Lyon         18            France   45.06   90.12
Örebro University                        11            Sweden   44.57   89.14

                                                                count
institution                              national_rank country
AGH University of Science and Technology 3             Poland       1
                                         4             Poland       1
Aalborg University                       5             Denmark      2
Aalto University                         4             Finland      2
Aarhus University                        2             Denmark      2
...                                                               ...
École normale supérieure - Paris         2             France       2
                                         3             France       1
École normale supérieure de Cachan       32            France       1
École normale supérieure de Lyon         18            France       2
Örebro University                        11            Sweden       2

[1766 rows x 3 columns]

In [29]:
# Merging and joining DataFraes
# Creating simple DataFrames
df1 = pd.DataFrame({'key': ['A','B','C'], 'Value1' : [1,2,3]})
df2 = pd.DataFrame({'key': ['A','B','D'], 'Value1' : [4,5,6]})

In [33]:
df1

  key  Value1
0   A       1
1   B       2
2   C       3

In [31]:
df2

  key  Value1
0   A       4
1   B       5
2   D       6

In [35]:
# Merge DataFrame on the 'Key columns'
pd.merge(df1,df2,on = "key", how = "inner")

  key  Value1_x  Value1_y
0   A         1         4
1   B         2         5

In [36]:
pd.merge(df1,df2,on = "key", how = "outer")

  key  Value1_x  Value1_y
0   A       1.0       4.0
1   B       2.0       5.0
2   C       3.0       NaN
3   D       NaN       6.0

In [ ]:
pd.merge(df1,df2,on = "key", how = "left") # df1 will be given the priority

  key  Value1_x  Value1_y
0   A         1       4.0
1   B         2       5.0
2   C         3       NaN

In [ ]:
pd.merge(df1,df2,on = "key", how = "right") # df2 will be given more importance

  key  Value1_x  Value1_y
0   A       1.0         4
1   B       2.0         5
2   D       NaN         6